{
  "id": 46290,
  "institutionId": 1660,
  "parentOrganizationId": null,
  "branchId": null,
  "name": "Campus Dept | PATH to Care Center",
  "shortName": null,
  "websiteKey": "pathtocare",
  "profilePicture": "17e501ac-60fc-4cbe-ace1-dc43fdf22d56a6569f89-39d0-41df-9d25-77db6595c13b.jpg",
  "profilePictureURL": "https://se-images.campuslabs.com/clink/images/17e501ac-60fc-4cbe-ace1-dc43fdf22d56a6569f89-39d0-41df-9d25-77db6595c13b.jpg",
  "description": "\u003cp\u003e\u003cbr /\u003eThe PATH to Care Center leads the efforts to transform our campus into a community that is free of sexual violence, sexual harassment, intimate partner violence, and stalking through prevention, advocacy, training, and healing. We collaborate with the campus community to make social change with the goals of preventing, intervening in, and responding to harassment and violence, eliminating oppression, and creating the culture and environment we all aspire to and deserve. We envision a campus community free of violence and grounded in social justice. This vision will be realized when every member of our community is a beacon of support and respect for those around them.\u003c/p\u003e\r\n\u003cdiv class=\"x_entry-content\"\u003e\r\n\u003ch2\u003e\u003cbr /\u003eMission\u003c/h2\u003e\r\n\u003cp\u003eThe PATH to Care Center leads the efforts to transform our campus into a community that is free of sexual violence, sexual harassment, intimate partner violence, and stalking through prevention, advocacy, training, and healing. We collaborate with the campus community to make social change with the goals of preventing, intervening in, and responding to harassment and violence, eliminating oppression, and creating the culture and environment we all aspire to and deserve.\u003c/p\u003e\r\n\u003ch2\u003eVision\u003c/h2\u003e\r\n\u003cp\u003eWe envision a campus community free of violence and grounded in social justice. This vision will be realized when every member of our community is a beacon of support and respect for those around them.\u003c/p\u003e\r\n\u003ch2\u003eValues\u003c/h2\u003e\r\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eWe believe prevention comes first.\u003c/strong\u003e\u003c/em\u003e\u0026nbsp;We know that with time and concerted efforts, violence is 100% preventable, and we believe that, as a UC Berkeley community, we have a moral imperative to prevent violence and suffering.\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eWe center survivors.\u003c/strong\u003e\u003c/em\u003e\u0026nbsp;Survivors began and are imperative to the movement to end sexual violence across the country; their experiences and perspectives are critical to healing and transforming our culture in genuine and meaningful ways.\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eWe are grounded in social justice.\u003c/strong\u003e\u003c/em\u003e\u0026nbsp;We understand that violence is rooted in oppression and that oppression is intersectional, so our approach must also be intersectional. We commit ourselves to expanding access, practicing inclusion, and undoing oppression wherever and whenever possible.\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eWe believe safety is a right.\u003c/strong\u003e\u003c/em\u003e\u0026nbsp;Every human in our community should receive respect for their bodily and emotional integrity and autonomy \u0026mdash; always, in every situation.\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eWe practice self-care and kindness.\u003c/strong\u003e\u003c/em\u003e\u0026nbsp;Work grounded in these practices is more sustainable, effective, and transformative.\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eWe seek and value the wisdom of our community.\u003c/strong\u003e\u003c/em\u003e\u0026nbsp;We take a communal approach to our work, knowing that we are all learning from each other.\u003c/p\u003e\r\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eWe are optimistic and hopeful.\u003c/em\u003e\u003c/strong\u003e\u0026nbsp;We know that, as a community, we can eliminate violence and create the campus community we want.\u003c/p\u003e\r\n\u003cp\u003e\u003cbr /\u003e_______________________________________\u003cbr /\u003e\u003cbr /\u003e\u003c/p\u003e\r\n\u003cp\u003eOpened in 2014, the PATH to Care Center quickly became a cornerstone of support for UC Berkeley students, faculty, and staff. The Center\u0026rsquo;s first big milestone came when the Chancellor announced Berkeley would create a confidential advocate position, a crucial resource for survivors seeking services, as well as for those seeking to understand or pursue a university disciplinary process.\u003c/p\u003e\r\n\u003cp\u003eLater in 2014, the first Bear Pact program launched, educating all incoming first-year and transfer undergraduate students about sexual violence prevention, with content designed and delivered by the University Health Services Health Promotion team. Following this, in the fall, the first advocate \u0026ndash; who would go on to become the Center\u0026rsquo;s first director \u0026ndash; was hired: Mari Knuth-Bouracee.\u003c/p\u003e\r\n\u003cp\u003eThe Center saw an immediate and overwhelming demand for services, which led to the ASUC and GA passing the Wellness Initiative Fee Referendum \u0026ndash; a commitment of student fees funding several initiatives, including a new advocate position for the Center. This Referendum solidified the University\u0026rsquo;s commitment to expanding the Center\u0026rsquo;s resources for all who need them, and helped lead to rapid growth: two advocates were hired, sexual violence prevention education was included for the first time in graduate student education, and an Assistant Director for Prevention joined the Center\u0026rsquo;s team. With the rapid expansion and demand for services, the Center quickly grew out of its one-room office and into a new space that included two counseling rooms for client meetings, crucial for confidentiality, in early 2016.\u003c/p\u003e\r\n\u003cp\u003eIn mid-2016, the Center added an Assistant Director for Survivor Support, a Program Analyst, and two Prevention Program Managers. The need for the Center was clear \u0026ndash; and in July, the US Office on Women\u0026rsquo;s Health awarded the University a grant, with the Center as the lead department, to continue to expand this work.\u003c/p\u003e\r\n\u003cp\u003eThe Center then launched a peer education program, which began with the hiring of 11 peer educators, as well as a Care Line, the 24/7 crisis line for the University. Continuing its focus on graduate student sexual violence prevention, the Center hired its first Program Manager for Graduate Prevention. The Center also launched The Well, a Black healing space co-led by a Center advocate.\u003c/p\u003e\r\n\u003cp\u003eSince its launch, the Center has continued to deepen its focus on both survivor support and prevention. By late 2017, videos created by the Center highlighting these practices had been shown to over 15,000 students, faculty and staff (and continue to be shown each year); the Center launched Yoga As Healing groups; and the Center received further recognition when the Office on Violence Against Women awarded the University a grant, with the Center as the lead department. Another major milestone was successfully advocating for funding for a Prevention Manager for Staff and Faculty Programs; a role that was filled in 2018. Today, the Center continues to expand in both its staff capacity and in the services it provides, further solidifying its place as a key resource for the University.\u003cbr /\u003e\u003cbr /\u003eContact us today for support!\u003c/p\u003e\r\n\u003c/div\u003e",
  "summary": "\r\nThe PATH to Care Center confidential advocates bring a holistic approach to supporting survivors. Advocates provide affirming, empowering, free, confidential support and bring a non-judgmental, caring approach to exploring all rights and resources.\r\n",
  "categoryIds": null,
  "categoryNames": null,
  "status": "Active",
  "visibility": "Public",
  "email": "pathtocare@berkeley.edu",
  "communityId": 219,
  "nameSortKey": "C",
  "comment": null,
  "showJoin": false,
  "statusChangeDateTime": "2021-06-16T18:14:01-04:00",
  "startDate": "1969-12-31T00:00:00-05:00",
  "endDate": null,
  "parentId": 45852,
  "wallId": null,
  "discussionId": 77859,
  "groupTypeId": null,
  "organizationTypeId": 2823,
  "cssConfigurationId": null,
  "deleted": false,
  "enableGoogleCalendar": false,
  "modifiedOn": "2021-06-18T00:12:13-04:00",
  "showFacebookWall": false,
  "showTwitterFeed": false,
  "isShownInPublicDirectory": true,
  "isAdminOnly": false,
  "isBranch": false,
  "legacyKey": 24510,
  "parentLegacyKey": null,
  "legacyPrimaryContactKey": null,
  "socialMedia": {
    "externalWebsite": "http://care.berkeley.edu",
    "facebookUrl": "https://www.facebook.com/PATHtoCare/",
    "twitterUrl": "",
    "twitterUserName": "",
    "instagramUrl": "https://www.instagram.com/pathtocareucb/",
    "linkedInUrl": "",
    "youtubeUrl": "https://www.youtube.com/channel/UC0w74dt0eTgLU9m6ttq65uQ/featured",
    "flickrUrl": "",
    "googleCalendarUrl": "",
    "googlePlusUrl": "",
    "pinterestUrl": "",
    "tumblrUrl": "",
    "vimeoUrl": ""
  },
  "primaryContact": {
    "id": "0aecdf74-ab0a-4f5d-bcae-cffe886842af",
    "firstName": "Mariana",
    "lastName": "Matthews",
    "preferredFirstName": null,
    "primaryEmailAddress": "mariana.matthews@berkeley.edu",
    "profileImageFilePath": null,
    "institutionId": 1660,
    "privacy": "Unselected"
  },
  "primaryContactId": {
    "communityMemberId": 31143364,
    "accountId": "0aecdf74-ab0a-4f5d-bcae-cffe886842af",
    "campusEmail": "mariana.matthews@berkeley.edu"
  },
  "contactInfo": [
    {
      "id": 100871,
      "addressType": -1,
      "phoneNumber": "510-643-2005",
      "extension": null,
      "faxNumber": null,
      "street1": "UC Berkeley ",
      "street2": null,
      "city": "Berkeley",
      "state": "CA",
      "zip": "94704",
      "country": " USA",
      "deleted": false
    }
  ],
  "organizationType": {
    "id": 2823,
    "branchId": 45852,
    "name": "Campus Departments",
    "showMembersToPublic": false,
    "showOfficersToPublic": true,
    "showMembersToLoggedInUsersByDefault": true,
    "showOfficersToLoggedInUsersByDefault": true,
    "autoApproveRequests": false,
    "eventsEnabled": true,
    "serviceHoursEnabled": true,
    "financeEnabled": true,
    "financeRequestsEnabled": true,
    "fundingRequestsEnabled": true,
    "purchaseRequestsEnabled": true,
    "budgetingEnabled": true,
    "budgetingRequestsEnabled": true,
    "electionsEnabled": true,
    "formsEnabled": true,
    "galleryEnabled": true,
    "outcomesEnabled": true,
    "rosterEnabled": true,
    "documentsEnabled": true,
    "shownInPublicDirectory": true,
    "isSystemType": false,
    "adminOnly": false,
    "isClosed": false,
    "reRegistrationAvailabilty": null
  },
  "categories": [],
  "submissions": [],
  "coverPhoto": {
    "id": 0,
    "imageId": "",
    "imagePath": "",
    "url": "",
    "thumbnailUrl": "",
    "caption": "",
    "dateCreated": "",
    "institutionId": 0
  },
  "imageServerBaseUrl": "",
  "baseUrl": "https://callink.berkeley.edu"
}