{
  "id": 46358,
  "institutionId": 1660,
  "parentOrganizationId": null,
  "branchId": null,
  "name": "Planning Students Association",
  "shortName": "PSA",
  "websiteKey": "gaplanningstudentsassociation",
  "profilePicture": "2fe47657-78b6-4828-8805-3ebcf98369e9541541c6-58c6-4d2d-9bfb-5f84c308244c.png",
  "profilePictureURL": "https://se-images.campuslabs.com/clink/images/2fe47657-78b6-4828-8805-3ebcf98369e9541541c6-58c6-4d2d-9bfb-5f84c308244c.png",
  "description": "\u003cp\u003e\u003cstrong\u003eWho are my Planning Students Association (PSA) Leaders?\u003c/strong\u003e\u003c/p\u003e\r\n\u003cp\u003eOrganizational Positions - January 2025 to December 2025\u003c/p\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003eCo-Presidents, Lisa Tran and Isabelle Hernandez\u003cbr /\u003e\u003c/em\u003e\u003c/p\u003e\r\n\u003cp\u003eThis person organizes the PSA meetings and makes sure that other officers and event organizers have what they need to get their jobs done. The president also meets regularly with the Department Chair and acts as a primary contact between the students and the Department on all issues including, but not limited to, course offerings, departmental operations and the PDST (also/formerly known as the PDF).\u003c/p\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003eVice President/Treasurer -\u0026nbsp;Shubhra Sharma\u003c/em\u003e\u003c/p\u003e\r\n\u003cp\u003eThis person works closely with the President to keep the PSA humming through joint agenda-writing and acting as a sounding board. The officeholder also tracks the finances of the PSA, helps other officers and event organizers submit funding and reimbursement requests, and prepares funding applications to the Graduate Assembly.\u003c/p\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003eSocial Chairs -\u0026nbsp;Marguerite Spaethling and Carson Mays\u003c/em\u003e\u003c/p\u003e\r\n\u003cp\u003eThis person is responsible for planning student involvement in the Holiday Party in the fall and the Planner Prom in the spring. The Social Chair helps out organizers of other events to manage logistics and get volunteers. The\u0026nbsp;Social Chair also\u0026nbsp;organizes and facilitates small, informal lunch discussions and happy hours with students and faculty members. GTKY get-togethers provide an opportunity for students and faculty to meet to discuss topics such as: planning as a career, advice for budding planners, personal experiences in the planning field, etc. Major responsibilities include: contacting professors to set up times/dates and sending out lunch announcements to the MCP current students email list.\u003c/p\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003eAlumni Liaison - Deni Arellano and\u0026nbsp;Shruti Venkatnarayan\u003c/em\u003e\u003c/p\u003e\r\n\u003cp\u003eThis person works with departmental faculty, staff and students to plan for the development of a robust alumni network.\u0026nbsp; This will include facilitation of creating an alumni database and drafting of an overall plan for alumni engagement. The liaison will be the student point of contact for a large alumni event, a facilitator of smaller events, and responsible for continued upkeep of the network.\u003c/p\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003eCommunications Chair - Jon Atkins\u003c/em\u003e\u003c/p\u003e\r\n\u003cp\u003eThis position oversees the Google group for incoming students, the MCP current students email list and the Planning-Announce email list.\u003c/p\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003eRecruitment Chair - Alex Kwong and Nishtha Kashyap\u003c/em\u003e\u003c/p\u003e\r\n\u003cp\u003eThis position helps the Department plan and recruit student volunteers for events targeted at prospective and incoming students, serving as a critical point of contact during this annual process. The team will work with the admissions team, keep current students informed of developments, and get to know the Department and College staff.\u003c/p\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003eAmerican Planning Association (APA) Rep - Samantha Wu Rose\u003c/em\u003e\u003c/p\u003e\r\n\u003cp\u003eThis position sits on the board of the Northern California APA section, makes sure the PSA is meeting its requirements as an official student organization, and keeps the students informed of APA events.\u003c/p\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003eCED Interdepartmental Group (CEDIG) Rep - Yutong Li and Varun Pais\u003c/em\u003e\u003c/p\u003e\r\n\u003cp\u003eThis position for DCRP stands as part of a college-wide effort to bring the four different departments within the CED out of their silos. In cooperation with the CED Graduate Student Council, the CEDIG representative advocates for and facilitates interdepartmental collaboration through workshops, seminars, peer reviews, social events, etc. These events, whether academic or social, create spaces where CED students can come together to form a stronger sense of community.\u003c/p\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003eMCP Student-Faculty Co-Chairs - Noelle Suh and Andrea Martinez\u003c/em\u003e\u003c/p\u003e\r\n\u003cp\u003eAlong with the President, this position is a primary contact between the students and the Department. The job entails attending faculty meetings and curriculum-related meetings where they represent student views and takes minutes to keep students informed.\u0026nbsp; The representative should solicit broad student feedback on items needing student input. This representative is informed of all faculty meetings, regular and ad hoc, and should attend all possible.\u003c/p\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003eGraduate Assembly (GA) Reps - Sam Arnett and Noelle Suh\u003c/em\u003e\u003c/p\u003e\r\n\u003cp\u003eThe GA Rep is required to attend at one GA-wide meeting per month (Thursdays at 6pm, usually 3-4 hours) as well as participate in one committee, which typically meet 1-2 times per month. Committees include external affairs (UC lobbying, etc), environmental, etc. The GA is responsible for funding for graduate organizations (like the PSA) and is the representative for graduate student interests within and outside of the University.\u003c/p\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003eUAW \u0026ndash; Union Liaison - Moneesha Kalamder\u003c/em\u003e\u003c/p\u003e\r\n\u003cp\u003eBy attending monthly UAW membership meetings, the PSA Union Liaison acts as a representative of DCRP to UAW meetings and will report back on important information pertinent to DCRP graduate students. This will provide for open communication between DCRP students and the Union, ensuring PSA members are informed about labor and equity issues on campus.\u003c/p\u003e\r\n\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\r\n\u003cdiv\u003e\u003cem\u003eMutual Aid Chair - Julian Rocha\u003c/em\u003e\u003c/div\u003e\r\n\u003cdiv\u003e\u0026nbsp;\u003c/div\u003e\r\n\u003cdiv\u003eThis person works closely with CEDSOC and other CED student organizations to build and maintain a new program: a CED-wide lending library and mutual aid system. This program, launching in Spring 2022, will offer direct support to students with financial need, a library of reusable materials and shared space for community building activities.\u003c/div\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003e\u003cspan style=\"font-weight: 300;\"\u003eLounge Ambassador - Andrea Torres\u003c/span\u003e\u003c/em\u003e\u003c/p\u003e\r\n\u003cp\u003eThis position is responsible for overseeing and maintaining the MCP student lounge, which includes orienting new students to the space, arranging locker distribution, organizing the cleaning schedule, and advocating for the lounge when necessary.\u003c/p\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003eSwag Chair(s) - Karna Goswami and Jamie Noh\u003c/em\u003e\u003c/p\u003e\r\n\u003cp\u003eThis position is responsible for designing, selling and delivering DCRP swag (clothing, mugs, tote bags, etc.) to DCRP students. Funds raised from sales go back to the PSA general budget to support events.\u003c/p\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u003cem\u003eMCP Archivist Co-Chairs - Ben Biniaz and Mei Mei Collins\u003c/em\u003e\u003c/p\u003e\r\n\u003cp\u003eThis position is responsible for compiling records in the MCP program to facilitate information sharing across cohorts, particularly related to maintaining institutional memory regarding coursework. Records may include course syllabi, student-solicited course information, lists of courses taken outside of the department, and capstones/theses. This also includes the maintenance of a job opportunities and funding database, and coordination with the alumni liaisons\u0026nbsp;regarding the alumni database. As a new position, the major responsibilities include the initial development of database structures to maintain archives in the future.\u0026nbsp;\u003c/p\u003e\r\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e",
  "summary": "The Planning Students Association (PSA) works with graduate students, faculty, and staff in the Department of City and Regional Planning (DCRP) to support career advancement; organize social events; and represent graduate interests within the department.",
  "categoryIds": [
    "5105"
  ],
  "categoryNames": [
    "Graduate Student Organizations "
  ],
  "status": "Active",
  "visibility": "Public",
  "email": "lisa.tran@berkeley.edu",
  "communityId": 219,
  "nameSortKey": "P",
  "comment": null,
  "showJoin": false,
  "statusChangeDateTime": "",
  "startDate": "1969-12-31T00:00:00-05:00",
  "endDate": null,
  "parentId": 45852,
  "wallId": null,
  "discussionId": 77927,
  "groupTypeId": null,
  "organizationTypeId": 1243,
  "cssConfigurationId": null,
  "deleted": false,
  "enableGoogleCalendar": false,
  "modifiedOn": "2025-01-27T14:13:41-05:00",
  "showFacebookWall": false,
  "showTwitterFeed": false,
  "isShownInPublicDirectory": true,
  "isAdminOnly": false,
  "isBranch": false,
  "legacyKey": 25967,
  "parentLegacyKey": null,
  "legacyPrimaryContactKey": null,
  "socialMedia": {
    "externalWebsite": "",
    "facebookUrl": "",
    "twitterUrl": "",
    "twitterUserName": null,
    "instagramUrl": "",
    "linkedInUrl": "",
    "youtubeUrl": "",
    "flickrUrl": "",
    "googleCalendarUrl": "",
    "googlePlusUrl": "",
    "pinterestUrl": "",
    "tumblrUrl": "",
    "vimeoUrl": ""
  },
  "primaryContact": {
    "id": "aec5e6fe-7503-48a2-8c4a-cd1fbdc354c7",
    "firstName": "Lisa",
    "lastName": "Tran",
    "preferredFirstName": null,
    "primaryEmailAddress": "lisa.tran@berkeley.edu",
    "profileImageFilePath": null,
    "institutionId": 1660,
    "privacy": "Unselected"
  },
  "primaryContactId": {
    "communityMemberId": 42682039,
    "accountId": "aec5e6fe-7503-48a2-8c4a-cd1fbdc354c7",
    "campusEmail": "lisa.tran@berkeley.edu"
  },
  "contactInfo": [
    {
      "id": 189213,
      "addressType": 0,
      "phoneNumber": null,
      "extension": null,
      "faxNumber": null,
      "street1": "Wurster Hall",
      "street2": null,
      "city": "Berkeley",
      "state": "CA",
      "zip": null,
      "country": "United States",
      "deleted": false
    }
  ],
  "organizationType": {
    "id": 1243,
    "branchId": 45852,
    "name": "Registered Student Organizations",
    "showMembersToPublic": false,
    "showOfficersToPublic": false,
    "showMembersToLoggedInUsersByDefault": false,
    "showOfficersToLoggedInUsersByDefault": false,
    "autoApproveRequests": false,
    "eventsEnabled": true,
    "serviceHoursEnabled": true,
    "financeEnabled": true,
    "financeRequestsEnabled": true,
    "fundingRequestsEnabled": true,
    "purchaseRequestsEnabled": true,
    "budgetingEnabled": false,
    "budgetingRequestsEnabled": false,
    "electionsEnabled": true,
    "formsEnabled": true,
    "galleryEnabled": true,
    "outcomesEnabled": true,
    "rosterEnabled": true,
    "documentsEnabled": true,
    "shownInPublicDirectory": true,
    "isSystemType": false,
    "adminOnly": false,
    "isClosed": false,
    "reRegistrationAvailabilty": null
  },
  "categories": [],
  "submissions": [],
  "coverPhoto": {
    "id": 0,
    "imageId": "",
    "imagePath": "",
    "url": "",
    "thumbnailUrl": "",
    "caption": "",
    "dateCreated": "",
    "institutionId": 0
  },
  "imageServerBaseUrl": "",
  "baseUrl": "https://callink.berkeley.edu"
}